Terraform plan in __.__
<details>
  <summary>Plan: 1 to add, 0 to change, 1 to destroy.</summary>

```hcl
An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.catalog_next.module.redis.aws_elasticache_replication_group.redis[0] must be replaced
-/+ resource "aws_elasticache_replication_group" "redis" {
      + apply_immediately              = (known after apply)
      ~ arn                            = "arn:aws:elasticache:us-east-1:587807691409:replicationgroup:rep-sandbox-catalog-next" -> (known after apply)
      ~ at_rest_encryption_enabled     = false -> (known after apply)
      ~ auth_token                     = (sensitive value)
        auto_minor_version_upgrade     = true
        automatic_failover_enabled     = false
      ~ cluster_enabled                = false -> (known after apply)
      + configuration_endpoint_address = (known after apply)
        engine                         = "redis"
        engine_version                 = "5.0.6"
      ~ engine_version_actual          = "5.0.6" -> (known after apply)
      + global_replication_group_id    = (known after apply)
      ~ id                             = "************************" -> (known after apply)
      ~ maintenance_window             = "mon:08:00-mon:09:00" -> (known after apply)
      ~ member_clusters                = [
          - "rep-sandbox-catalog-next-001",
        ] -> (known after apply)
        multi_az_enabled               = false
        node_type                      = "cache.t3.small"
        number_cache_clusters          = 1
        parameter_group_name           = "default.redis5.0"
        port                           = 6379
      ~ primary_endpoint_address       = "master.rep-sandbox-catalog-next.5kspe7.use1.cache.amazonaws.com" -> (known after apply)
      ~ reader_endpoint_address        = "replica.rep-sandbox-catalog-next.5kspe7.use1.cache.amazonaws.com" -> (known after apply)
        replication_group_description  = "Redis replication group for sandbox-catalog-next"
        replication_group_id           = "************************"
        security_group_ids             = [
            "sg-04ac68960eeae33ae",
        ]
      ~ security_group_names           = [] -> (known after apply)
      - snapshot_retention_limit       = 0 -> null
      ~ snapshot_window                = "05:00-06:00" -> (known after apply)
        subnet_group_name              = "catalog-next-sandbox"
        tags                           = {
            "env"  = "sandbox"
            "name" = "catalog-next"
        }
        tags_all                       = {
            "env"  = "sandbox"
            "name" = "catalog-next"
        }
        transit_encryption_enabled     = true

      ~ cluster_mode {
          ~ num_node_groups         = 1 -> (known after apply)
          ~ replicas_per_node_group = 0 -> (known after apply)
        }
    }

Plan: 1 to add, 0 to change, 1 to destroy.

Warning: Provider source not supported in Terraform v0.12

  on /github/home/.dflook-terraform-data-dir/modules/vpc.vpc/versions.tf line 5, in terraform:
   5:     aws = {
   6:       source  = "hashicorp/aws"
   7:       version = ">= 2.70"
   8:     }

A source was declared for provider aws. Terraform v0.12 does not support the
provider source attribute. It will be ignored.
```
</details>

Plan generated in [plan #37](https://github.com/GSA/datagov-infrastructure-live/actions/runs/1216034015)